/* Alert message delivered when there is something that prevents the user from adding a new photo to the database that the user can do nothing about. */
"ALERT_CANT_ADD_PHOTO" = "Sorry, this device cannot add a photo.";

/* Alert given to user when they try to filter a photo, but they haven't even taken a photo yet. */
"ALERT_CANT_FILTER_WITHOUT_PHOTO" = "You must take a photo first!";

/* Text on button which dismisses an alert which explained a problem adding a photo to the database. */
"ALERT_DISMISS_BUTTON" = "OK";

/* User tried to dismiss modal controller to add a photo, but the location the photo was taken could not be found maybe because the user has no network connection active. */
"ALERT_LOCATION_NETWORK_DISABLED" = "Can't figure out where this photo is being taken.  Verify your connection to the network.";

/* User tried to dismiss modal controller to add a photo, but the location the photo was taken could not be found because the user needs to enable location services in the Settings application. */
"ALERT_LOCATION_SERVICES_DISABLED" = "Location Services disabled under Privacy in Settings application.";

/* User tried to dismiss modal controller to add a photo, but the controller cannot figure out the location the photo was taken. */
"ALERT_LOCATION_UNKNOWN" = "Can't figure out where this photo is being taken, sorry.";

/* User tried to dismiss modal controller to add a photo, but the controller had not (yet) found the location the photo was taken. */
"ALERT_LOCATION_UNKNOWN_YET" = "Couldn't figure out where this photo was taken (yet).";

/* User tried to dismiss modal controller to add a photo, but had not taken a photo at that point. */
"ALERT_NO_PHOTO_TAKEN" = "No photo taken!";

/* Title of an alert that appears when there is a problem adding a photo to the database. */
"ALERT_TITLE_ADD_PHOTO" = "Add Photo";

/* User tried to dismiss modal controller to add a photo, but had not specified a title for the photo, which is required. */
"ALERT_TITLE_REQUIRED" = "Title required!";

/* Action sheet choice which cancels filtering an image. */
"FILTER_ACTION_SHEET_CANCEL" = "Don't Filter";

/* Title of Filter Image action sheet. */
"FILTER_ACTION_SHEET_TITLE" = "Filter Image";

/* Action sheet choice for applying a blurring filter to a photo taken by the user. */
"FILTER_BLUR" = "Blur";

/* Action sheet choice for applying a chrome filter to a photo taken by the user. */
"FILTER_CHROME" = "Chrome";

/* Action sheet choice for applying a fade filter to a photo taken by the user. */
"FILTER_FADE" = "Fade";

/* Action sheet choice for applying a noir filter to a photo taken by the user. */
"FILTER_NOIR" = "Noir";

